/*

"إنَّ الحمد لله نحمده ونستعينه ونستغفره،
 ونعوذ بالله من شرور أنفسنا وسيِّئات أعمالنا
 ، مَن يهده الله فلا مُضلَّ له، ومَن يُضلل فلا هادي له، وأشهد أن لا إله إلا الله وحده لا شريكَ له،
  وأشهد أنَّ محمدًا عبده ورسوله، صلَّى الله وسلَّم وبارك عليه، وعلى آله وصحبه أجمعين."

رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي

اللَّهُمَّ اجْعَلْ عَمَلَنَا هذَا خَالِصًا لِجَلَالِ وَجْهِكَ الكَرِيمِ، وَاجْعَلْهُ عَوْنًا لَنَا عَلَى طَاعَتِكَ.
اللَّهُمَّ انْفَعْنَا بِمَا عَلَّمْتَنَا، وَعَلِّمْنَا مَا يَنْفَعُنَا.
رَبِّ يَسَّهِّلْ عَلَيْنَا وَيُوَفِّقْنَا إِلَى مَا يُحِبُّهُ وَيَرْضَاهُ.

بسم الله الرحمن الرحيم

 */

void main(){}